import styles from "./RedactorInstructions.module.scss";

export default function RedactorInstructions() {
	return (
		<div className={styles.container}>
			<p>
				Спочатку Вам необхідно буде заповнити <span className={"semibold"}>короткий опис</span> -
				це обов’язково. Після цього переходьте до створення{" "}
				<span className={"semibold"}>детального опису</span>. У ньому є достатньо інструментів
				для створення будь-якої текстової складової.
			</p>
			<h5>Інструменти редактора</h5>
			<p>
				<span className={"semibold"}>Заголовок</span> – створює поле, куди можна вписати
				заголовок. Використовуйте для назв розділів або важливих частин тексту.
			</p>
			<p>
				<span className={"semibold"}>Абзац</span> – створює поле для звичайного тексту.
				Використовуйте для основного змісту.
			</p>
			<p>
				<span className={"semibold"}>Нумерований список</span> – створює список із цифрами (1.,
				2., 3. …). Підійде для покрокових інструкцій чи будь-яких даних, які важливо подати по
				порядку.
			</p>
			<p>
				<span className={"semibold"}>Маркований список</span> – створює список із крапками (
				<span className={styles.link}>■</span>). Зручно для переліків без обов’язкової
				послідовності.
			</p>
			<p>
				<span className={"semibold"}>Гіперпосилання</span> – спосіб переслати на будь-яку адресу
				сайту з необхідного тексту:
			</p>
			<ol>
				<li>Спочатку виділіть необхідний текст;</li>
				<li>
					Потім натисніть на кнопку: <span className={"semibold"}>Гіперпосилання</span>, щоб
					відкрити меню;
				</li>
				<li>
					У полі <span className={"semibold"}>”Вставте посилання”</span> введіть адресу
					сторінки;
				</li>
				<li>
					За бажанням можна зробити так, щоб посилання відкривалося в новій вкладці. Для цього
					натисніть на бланк (<span className={styles.link}>☐</span>) біля відповідного тексту.
				</li>
			</ol>
			<p>
				Після цих операцій текст прийме такий вигляд. Щоб видалити посилання, зітріть текст
				клавішею <span className={"semibold"}>← Backspace</span>.
			</p>
			<p>
				<span className={"semibold"}>Фото</span> – створює блок із картинкою та її описом:
			</p>
			<ol>
				<li>
					Спершу натисніть на кнопку: <span className={"semibold"}>Завантажити фото</span>, щоб
					завантажити фото;
				</li>
				<li>Потім заповніть поле опису під завантаженим фото.</li>
			</ol>

			<h5>Загальні правила користування редактором</h5>

			<p>
				Всі вставлені типи блоків з панелі інструментів редактора працюють за однаковими
				правилами:
			</p>

			<ol>
				<li>
					<span className={"semibold"}>↲ Enter</span> – створює новий рядок або новий пункт
					списку;
				</li>
				<li>
					<span className={"semibold"}>↑ Shift + ↲ Enter</span> – переносить текст на наступний
					рядок, але в межах того ж блоку (корисно для розбиття абзацу на кілька рядків);
				</li>
				<li>
					<span className={"semibold"}>← Backspace – видаляє текст</span>, а якщо поле порожнє
					– видаляє увесь блок;
				</li>
				<li>
					<span className={"semibold"}>― Пробіл</span> – видаляє пункт списку;
				</li>
				<li>
					<span className={"semibold"}>
						<span className={styles.red}>×</span> (хрестик зліва від блоку тексту)
					</span>{" "}
					– одразу видаляє весь блок разом із його вмістом;
				</li>
			</ol>

			<p>
				Таким чином, Ви легко зможете створювати текст із заголовками, абзацами, списками,
				фотографіями та посиланнями, а також змінювати порядок блоків чи видаляти непотрібні.
			</p>
		</div>
	);
}
